#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b8d474eb-690d-4ff6-943b-d1f11c0df54f]
module.keycloak_dev.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b2affc5e-aaed-4191-8cf6-aabd7da3c259]
module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=99e2ea22-a390-4c6a-925f-208ae157d307]
module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=29cf4f38-7e15-4d60-98b1-15ef1797548a]
module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f23a948f-80a7-410b-9ea5-130b4f8d5227]
module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a42c1d94-9fcb-4b93-9a88-676a1a70b3f3]
module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=af655271-36d3-4952-b9c0-97e5718062b2]
module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6b67ec10-ac9c-469b-96aa-3b1627801392]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=01f34eee-1a4d-4f22-92b1-e08852badc69]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8d851f77-9abe-499c-b6c1-85c82800140b]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3bbf1856-ce26-4a86-87a2-8e83330980f3]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=47f1083e-cf1d-4a5a-9298-b56542faec7d]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0a3c30d8-a46c-4cee-a25f-fd205b3ab4c4]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=35e9a0b2-f32d-4127-a114-e96b6ea2092f]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=111cbd3a-93b6-4663-add5-26189645bb2f]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5a88a401-584d-4d51-914f-ca95b639616d]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ae175926-b10c-4e1e-b0d1-dca7d45e5af1]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=58107528-7fc6-441f-aef4-7f8fd52bbe3b]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0ff4b484-25ce-4a9d-b2cd-cef618846d0d]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b7e48458-fd2a-4dd7-a07f-606ba16a6ef2]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=28c2b610-f326-4432-a070-d6a53a73e545]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8767f238-14c1-40a7-b5c7-637225122ce7]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1e33299f-6543-4a86-8be2-2df9259e26a6]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=06a1f71b-7f6c-41e1-bda8-730e1e66bd2a]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3581290c-b8db-43cf-8200-7a2e7a181f13]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=614c4c6e-6791-4223-bf67-7e3c5c2c5fad]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=202223a0-a71a-43df-b86e-d8a0e19603b6]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=18ac95f7-15d8-426d-a2f8-74aef2c9833a]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d24ad71d-4a12-4c7c-abd0-45d51729bb9e]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b1fb3a12-bd49-4b35-90ff-3894904dd0f8]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5cd65f11-28ca-4761-9372-aa0514719b43]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1a95fbf4-d7e6-4510-85ea-1eddf4f7763b]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ede2ef2f-0db7-4163-91d9-893300e3a68a]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b5b248c8-6436-4bf4-9ccb-6f4c98a9f3f3]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7a9e79da-e1da-4dfd-a7d7-336cdefe91a1]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a3dd3dbe-84af-41aa-aa94-15eb4d4d7dbb]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=341d12dd-9534-42eb-9f1b-e97ab0283cf4]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cef6c1e2-d907-4fa7-8168-81c7930f3eb2]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d5471293-c661-4e0b-a6f7-5520712c4392]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7f36873e-e532-4665-adfb-e67bef1bdfdd]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a486276e-2359-42aa-b7f5-624e9bbdaaac]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b7c4055c-8f66-459f-94e4-cf51b597c772]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=242f559a-5b9f-4351-abda-4aa1cd1ea96f]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=656ea0c6-04d0-4953-a670-9482828b9b56]
module.keycloak_dev.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=afcd2474-0353-44cb-b5c4-39e4de8c5598]
module.keycloak_dev.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e0c76ee3-5bcc-4d6c-b086-7fc605bcd4a5]
module.keycloak_dev.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1edd6eee-c017-49f3-8c9c-d77af81fd439]
module.keycloak_dev.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a61d689e-8a44-44ab-b0a1-c7ec8820eb40]
module.keycloak_dev.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a523b37b-eca6-4562-9403-4605d63571a7]
module.keycloak_dev.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e4bee5c3-2071-4e8a-9978-406b995de4bd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "cypress-test-1689"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1689.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1689"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1689"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "cypress-test-1689"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1689.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1689"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1689"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "cypress-test-1689"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1689.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1689.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1689"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1689"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2030 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*